{
    "pages": [
        {
            "title": "Day 64", 
            "text":"Day 54 Published last at 23:07 September 9 2020, subject to change throughout the day. There was a delay, in the news. I was convinced I was in the parallel universe. But. Nope. Let&#39;s get to it: Defaming those that have laid their lives down for the good ol&#39; USA Another book, another law suite A vaccine never tested, is the way to go right? Guess what all those have in common .... You got it. News Dejoy is gargabe - Save USPS Washington Post - Louis DeJoy’s rise as GOP fundraiser was powered by contributions from company workers who were later reimbursed, former employees say Trust big pharma says, no one - COVID vaccine NYT - Pharma Companies Plan Joint Pledge on Vaccine Safety Tennis steps up, thank you Naomi Osaka - Black Lives Matter Trayvon Martin&#39;s mom, Ahmaud Arbery&#39;s dad thank Naomi Osaka for wearing masks at U.S. Open Events Ooooooo the debates are coming up. I cannot wait. Specifically: &#34;The 2020 United States Presidential Debates will be held Tuesday, September 29, Thursday, October 15, and Thursday, October 22, 2020. The Vice Presidential debate will be held Wednesday, October 7, 2020.&#34; Thanks wiki! Also the enitre calendar of &#39;festivities&#39; for Presidential USA 2020 are here. Call to Action Register to vote at IWillVote.com. Then, if you can help power the polls by being a pollworker. Voy a trabajar! Let&#39;s have fun, no? HOLA MIS AMORES. VOY A HABLAR PALABRAS EN ESPANOL DURANTE 3 DE NOVIEMRE PARA MIS HISPANOHABLANTES! Or ya know English. Woof. I&#39;ll be pulling a 4am to wwwwwwwwwwwho knows what time (2016 was 4am to 10pm). #Election2020— Loooorena &#34;La Tigresa&#34; Mesa @ #BlackLivesMatter 🖤 (@loooorenanicole) September 10, 2020 Just for fun Silkie chickens make me so happy. Here is a photo. Enjoy.", 
            "tags": "day-54", 
            "loc": "/day_54.html"
        },
        {
            "title": "Day 69", 
            "text":"Day 69 Published last at 6:20pm CDT August 26 2020, subject to change throughout the day. Where do we begin. Last night a white teenager from Illinois took it upon themselves to drive to Kenosha, armed with an AR-15, to join those - that some outlets are calling it - that are &#34;prepared to defend buildings&#34;. Said teenager proceeded to use their gun during the protests. Three are confirmed to have been shot, two of those fatally. Files have been charged. The NIMBY rheotric so proudly flaunted earlier this week at that convention is eeirely timed with this. Let&#39;s not write this off as the lone act of a vigilante. We need to name what this act is, white supremacy. Chicago&#39;s WBEZ reported: According to witness accounts and video footage, police apparently let the young man responsible for the shootings walk past them with a rifle over his shoulder as members of the crowd were yelling for him to be arrested because he had shot people. White supremacy is domestic terrorism. A 17-year-old with a history of racist and misogynistic social media posts traveled to Kenosha and murdered two protesters. This is white supremacist terrorism.https://t.co/bHQzvFZ0LQ— African American Policy Forum (@AAPolicyForum) August 26, 2020 News Kenosha - Protests, Murder, &amp; Police Brutality WBEZ - Suspect Arrested After 2 People Were Shot And Killed During Kenosha Protest Kenosha - Protests, Murder, &amp; Police Brutality CNN - Two people are dead and a third injured in an overnight shooting in Kenosha, police say Kenosha - Protests, Murder, &amp; Police Brutality NBC Chicago - Teen Suspect in Kenosha Shooting Taken Into Custody in Illinois, Facing Charges: Police RNC Convention - Ethics: False Representation The Wall Street Journal - Immigrants in Trump-Led Ceremony Didn’t Know They Would Appear at RNC RNC Convention - Ethics: Hatch Act Business Insider - Trump aides &#39;take pride&#39; in violating ethics laws because it upsets the media at no cost to them, reports say RNC Convention - Ethics: Hatch Act POLITICO - Meadows dismisses Hatch Act concerns at RNC: &#39;Nobody outside of the Beltway really cares&#39; COVID19 - How COVID spreads NBC Chicago - How COVID-19 Most Commonly Spreads in Chicago: Arwady Events If this week isn&#39;t showing why we all need to show and engage in antiracism work, well Kim Crayton will show you. She is running &#34;Being an Antiracist at Home&#34; on Saturday August 29 2020 @ 10:00am CDT register today. Please note the workshop requires you to read The 1619 Project. Deepfakes are terrifying, especially as we see all the &#34;fake news&#34; rheotric thrown around. Learn about Deepfakes and the US Elections with University of Washington’s Center for an Informed Public and Microsoft on Tuesday September 1 2020 @ 1:00pm CDT. Register here. Run for Something has a series of &#34;Unapologetically Progressive&#34; events in battleground states. The next event - Unapologetically Progressive in Michigan - is on September 15 2020 @ 7:00pm CDT you can register here. Pop over to their event page for all the other events in the series here. Call to Action The headlines from Kenosha have been rough. So, take some time to educate yourself on self care. Here&#39;s a few options: &#34;Why Self Care isn&#39;t Selfish&#34; is a 12ish min TedEx talk that can get you started. &#34;A history of Self-Care&#34; write up by Slate. A set of &#34;5 Simple Self-Care Practices You Can Implement Now&#34; at a 3 minute read is a win/win! Register to vote. You know the drill, register at IWillVote.com. Just for fun I mentioned loving scifi and fantasy earlier. The official accompanying podcast for Lovecraft Country is 🔥. Y&#39;all should check it out. Why? Here&#39;s a few reasons why 👇🏾 The podcast hosts are EPIC - Ashley C. Ford and Lovecraft Country writer Shannon Houston. I got all my work done today, and I remembered I’m beautiful, so that’s a win.— Ashley C. Ford (@iSmashFizzle) August 26, 2020 Learning about the writing room is fascinating. Think horror isn&#39;t that interesting? Try again! &#34;Horror is the last place for hope&#34; as co-host Ashley C. Ford sums up. This podcast will challenge how you think of scifi, fantasy, and horror. It is a much needed critical exploration in how privilege, racism, and white supremacy inform but also can be confronted in the creative spaces of storytelling and entertainment. Go listen now, available on Spotify and other fine places.", 
            "tags": "day-69", 
            "loc": "/day_69.html"
        },
        {
            "title": "Day 70", 
            "text":"Day 70 Published last at 1:55pm CDT August 25 2020, subject to change throughout the day. I&#39;m a huge fantasy and sci-fi nerd. Reading the update on what&#39;s next for The Dark Crystal, Lisa Henson observed, &#34;We have the Darkness creeping in, &amp; it feels like Darkness has arrived in the human world now. The carelessness for life, that sort of self-interest business of the Skeksis... the[y] are ruthless.&#34; This struck me hard -- the Dark Crystal is a reflection of the here &amp; now. Let me explain. Last night I observed the metaphorical Skeksis at The Republican National &#34;Convention&#34;. Yes, I know, &#34;why&#34; is likely a question you have. I wondered that too. (Also: if about 1/2 the lineup involves your family be them blood or by relationship is that really a strong sign of unity?) Night one was precisely as bizarre as expected. &#34;time to conquer earth!&#34; pic.twitter.com/VDQLKQscaW— ziwe (@ziwe) August 25, 2020 From people with no political know how to a &#34;not in my backyard couple&#34; made famous by touting guns and making veiled racist threats, night one demonstrated nothing. Nothing except the convention is a spectacle and the current admin will lie, cheat, and do anything to promote their interests. I walked away from night 1 of the DNC seeing Binden as a human. I&#39;m walking away from this wondering why Trump&#39;s kids can&#39;t even say he&#39;s a good person or they love him.— Jeff says, &#34;wear a mask&#34; 😷 (@webology) August 25, 2020 Meanwhile in Kenosha, Wisconsin after the shooting of Jacob Blake, another unarmed Black man, protestors took to the streets. The National Guard was called in. Also, Blake&#39;s family announced he is paralyzed from the waist down. When will the senseless brutalization of POC, but particularly the Black community stop? If you&#39;re a white person go sign up for Kim Crayton&#39;s &#34;Being an Antiracist at home&#34; happening on Saturday (see events below 👇🏽). Everyone, register to vote over at IWillVote.com. News Police Brutality - Shooting and protests of Jacob Blake Washington Post - After video shows Wisconsin police shooting a Black man multiple times, National Guard is called to Kenosha USPS - Vote by mail Rolling Stone - Rep. Katie Porter Exposes the Dangerous Ignorance of Postmaster General Louis DeJoy USPS - Vote by mail Forbes - Washington Postal Workers Defy USPS Orders And Reinstall Mail Sorting Machines COVID19 - Vaccine - ABC News - FDA chief apologizes for overstating plasma effect on virus COVID19 - Vaccine - Chicago WGN9 - COVID-19 vaccine trial kicks off in Chicago: Very first participants roll up their sleeves Events Looking to show up and start doing the work of being an antiracist? Kim Crayton has you covered and is running &#34;Being an Antiracist at Home&#34; on Saturday August 29 2020 @ 10:00am CDT register today. Please note the workshop requires you to read The 1619 Project. Call to Action BallotReady is a great way to start learning the platforms of candidates in the elections happening in your area! Go check it out. Prepare your voting plan at IWillVote.com. Weekly the City of Chicago - Emergency Travel Order updates its emergency travel order. As today&#39;s update alerted, &#34;1/2 of all new Chicago cases are Latinx peoples&#34;. Stay up to date for travel orders in your area. Just for fun Gen Z is sexualizing USPS to save it. And it&#39;s great. Art by Tumblr user introvertia pic.twitter.com/w7Y5BOlZ0I— Ives Phillips (@itisi_ives) August 19, 2020", 
            "tags": "day-70", 
            "loc": "/day_70.html"
        },
        {
            "title": "Day 74", 
            "text":"Day 74 Published last at 3:00pm CDT August 21 2020, subject to change throughout the day. Last night was the final night of the DNC Convention and there was no better way to start than with the adorable Cedric Jr, son of US Rep Cedric Richmond, posed in front of &#34;I am a man&#34; in a New Orleans art gallery, grinning ear to ear reciting the Pledge of Allegiance. CEDRIC YOU CUTIE PIE! YOU ARE MOST DEF THE MAN! #DemConvention #DemocraticConvention #DemConvention2020 pic.twitter.com/WQhzH01ztN— Loooorena &#34;La Tigresa&#34; Mesa @ #BlackLivesMatter 🖤 (@loooorenanicole) August 21, 2020 Focusing on telling the story of who Democratic Presidential nominee Vice President Joe Biden is, many stories of loss, faith, and family were shared by those that Biden has worked with and known over the years. However, there was plenty of comedic relief. Such as the short skit by TikTok star and comedian Sarah Cooper impersonating Trump. Last night&#39;s host actress and comedian Julia Louis-Dreyfus also added her own punches and twists, even going on the record to confirm she is &#34;proud to be a nasty, nasty woman&#34;. Trump is going to hate this. Thank you Sarah Cooper. #DemConvention pic.twitter.com/17qCbdRqSU— Keith Boykin (@keithboykin) August 21, 2020 Yes, I&#39;m here for all the nasty women. I, myself, am one. Thanks Julia. #DemConvention #DemConvention2020 #DNC2020 pic.twitter.com/BEATipf5eT— Loooorena &#34;La Tigresa&#34; Mesa @ #BlackLivesMatter 🖤 (@loooorenanicole) August 21, 2020 Biden&#39;s acceptance speech confirmed to many what they have been wondering, does Biden have enough energy to take on the Presidency? &#34;The best way through pain and loss and grief is to find purpose,&#34; Biden retorted on how loss in his life has been a catalyst for much of his career. Moving beyond idea that on moral grounds alone Biden is the right choice, though, Biden included some policy components of how to increase life for working class peoples. For example, Biden said he would revert the $1.3 trillion tax cut for the wealthiest 1 percent to fund climate change policy, healthcare reform, and more. As a staunch progressive, I expect to see and need to hear more about how we will work to challenge institutional racism and other forms of opression. How we will protect the most vulnerable. How we will take climate change seriously. How we will ensure immigrants and refugees are welcome in the United States of America. Last night was a big step. However, there&#39;s still a lot more work to do. Now, go over and get your voting plan together at 🗳️ IWillVote.com 🗳️ . News Election 2020 - Latinx Vote The American Prospect - Voting for Our Lives: For Latino voters, changing the nation’s rhetoric is a matter of life and death.s Voting - Mail in Washington Post - Here’s why the Postal Service wanted to remove hundreds of mail-sorting machines DNC Convention - Day 4 Recap NPR - Highlights From Night 4 DNC Convention - Day 4 Recap FiveThirtyEight - What Went Down On The Final Night Of The DNC Election 2020 - Forecast Jacobin - Joe Biden and the Democrats Could Still Screw This Up Trump Administration - Fraud Vice - How Steve Bannon’s Alleged ‘We Build the Wall’ Scam Worked Events Are you energized from the DNC Convention and looking for ways to help Election 2020? The Democrats have an online catalog of events available on their website that allows you to target local events. Haymarket Books has a variety of teach-ins with deep dives on topical issues related to Election 2020. On September 1 2020 @ 7:00pm CDT join for Study and Struggle: Abolition as Study and Deconstructing Racial Capitalism, the first in a series of Critical Conversations organized by Study and Struggle discussing prison abolition and immigrant justice. RSVP here. Decoding the Election hosted by San Francisco’s Computer History Museum on September 16 2020 @ 1:00pm CDT. Panel moderator Steven Levy, Wired editor, will engage panelists to learn about role of social media and AI in USA elections. Register here. Call to Action Pop over to BallotReady and start learning the platforms of candidates in the elections happening in your area! Prepare your voting plan at IWillVote.com. Just for fun Refinery 29 has compiled a series called &#34;Diaries from the Front Lines of the 2020 Election&#34; looking at the women powering the election! Reading about these powerful women, like Biden for President Deputy Digital Director Clarke Humphrey, is great way to celebrate these women as well as get yourself motivated to stay engaged for Election 2020! Take a trip through time seeing how folks supported their party at political conventions of yesteryear.", 
            "tags": "day-74", 
            "loc": "/day_74.html"
        },
        {
            "title": "Day 75", 
            "text":"Day 75 Published last at 10:15am CDT August 20 2020, subject to change throughout the day. President Barack Obama, speaking at last night&#39;s Democratic Convention from Pennsylvania, delivered an emotionally charged and somber address. His message was simple, do not give up. Stay engaged. Plan: &#34;That is how *THEY* have influence over your life, when *THEY* convince [you that do not matter]; DO NOT LET THEM TAKE AWAY YOUR POWER, YOUR DEMOCRACY.&#34; - @BarackObama This. Is all you need to remember. Stay with me. Let&#39;s do it. #DemConvention #DemConvention2020— Loooorena &#34;La Tigresa&#34; Mesa @ #BlackLivesMatter 🖤 (@loooorenanicole) August 20, 2020 Furthermore, last night&#39;s Democratic Convention addresses focused on the role of women in politics. Notably Speaker of the House Nancy Pelosi pointing out, &#34;as America marks the centennial of women, finally, women winning the right to vote, we do so with 105 women in the House. Proudly, 90 are Democrats.&#34; KEEP RISING! (Notice @aoc is in the center. 👀😍). #DemConvention #DemConvention2020 #DemocraticConvention pic.twitter.com/s71Sy0cAYX— Loooorena &#34;La Tigresa&#34; Mesa @ #BlackLivesMatter 🖤 (@loooorenanicole) August 20, 2020 While we celebrate the rise of women in the USA government, we need to remember that as we celebrate the 100th year anniversary of women gaining the right to vote this right was not universally applied to all women. As Black (and indigenous women) continued to confront barriers to vote. Notably Black women were subject to racist state laws that aimed to keep Black Americans from voting. &#34;The 19th Amendment did not addres violence or lynching&#34;, Martha S. Jones author of &#34;Vanguard: How Black Women Broke Barriers, Won the Vote, and Insisted on Equality for All&#34; explains. Put another way, Democratic Vice President nominee Kamala Harris, explains this duality by stating simply, &#34;there is no vaccine for racism, we&#39;ve go to do the work. For George Floyd. for Breonna Taylor, for all the lives of too many others to name ... &#34;. &#34;There is no vaccine for racism. We&#39;ve got to do the work. For George Floyd, for Breonna Taylor, for the lives of too many others to name... None of us are free until all of us are free.&#34; - Democratic vice presidential nominee Kamala Harris. #DemConvention https://t.co/LxbJJ2IiP2 pic.twitter.com/Sk6CtkSH2y— CNN (@CNN) August 20, 2020 The Democratic Convention continues tonight. Before that, go prepare your voting plan over at IWillVote.com. Update: Bannon has been arrested by USPS, at sea. 2020 y&#39;all. 2020. News Trump Administration - Tax Return New York Times - Trump Must Turn Over Tax Returns to D.A., Judge Rules Trump Administration - Fraud CNBC - Former Trump advisor Steve Bannon arrested on fraud charges in border wall fundraising scheme DNC Convention - Day 3 Recap NPR - Highlights From Night 3: Democratic Leaders Zero In On Trump Events Democratic National Contention 2020 culmintates tonight at 8:00pm CDT to 10:00pm CDT with Democratic Presidential nominee Vice President Joe Biden as he will accept the party nomination. For the full lineup, including speakers like Senator Tammy Duckworth, find the full schedule here, and watch live. Call to Action Get your flu shot. The WHO, Dr. Fauci, and many other health experts urge us all to get one as we wait for a COVID19 vaccine. Target/CVS already have flu shots, Walgreens is slated to start September 1 2020. Prepare your voting plan at IWillVote.com. Just for fun The Daily Social Distancing Show host Trevor Noah beautifully captured Michelle Obama&#39;s Democratic Convention with the following: &#34;That was ice-cold. And what made it even more devastating was that Michelle Obama wasn’t angry, she wasn’t yelling, she just stated Trump’s complete failure as a president as an obvious fact. You know, it’s the difference between your mom screaming at you and your mom just casually sipping a coffee and going, ‘Well, not all kids can be winners.’&#34; 🔥 🔥 🔥 HRC and pantsuits. Hillary Pantsuit GIF from Pantsuit GIFs Hillary Pantsuit GIF from Pantsuit GIFs", 
            "tags": "day-75", 
            "loc": "/day_75.html"
        },
        {
            "title": "Day 76", 
            "text":"Day 76 Published last at 8:50am CDT August 19 2020, subject to change throughout the day. Last night&#39;s virtual DNC Convention roll call brought us images reminding us who this country is: indigenous strength, such as the Sioux Nation at Standing Rock, of South Dakota STANDING ROCK! Hello Great Sioux Nation! 👋🏽👋🏽👋🏽👋🏽😍 #DemConvention #DemConvention2020 #DemocraticConvention pic.twitter.com/za0QYubeDr— Loooorena &#34;La Tigresa&#34; Mesa @ #BlackLivesMatter 🖤 (@loooorenanicole) August 19, 2020 proud Boricuas of Puerto Rico here to remind the admin they will not be silenced BORICUAAAAAAAAAASSSSSSSSSS. LATINX REPRESEEEEEEEENT!!!!!!!!!!!!!! 🇵🇷🇵🇷🇵🇷🇵🇷🇵🇷🇵🇷🇵🇷 #DNC2020convention #DNCConvention #DemConvention pic.twitter.com/KVyVQqJn83— Loooorena &#34;La Tigresa&#34; Mesa @ #BlackLivesMatter 🖤 (@loooorenanicole) August 19, 2020 Khizr Khan, a Pakistani American, of Virigina Four years after his speech at the DNC convention in 2016, Khizr Khan returns to represent Virginia in casting delegate votes for Bernie Sanders and Joe Biden pic.twitter.com/KIsrMq2VYG— Yashar Ali 🐘 (@yashar) August 19, 2020 queer POC business owners (inspiring me to go visit this fabulous Maine B&amp;B) Y’all let’s vacation at @CraigHickman &amp; his husband’s B&amp;B in Maine. This roll call has me feelin’ American again. https://t.co/P4Bprt4mOz— Lesa Kastanas (@thelesak) August 19, 2020 those that inspire us to bring the &#34;spirit of Good Trouble&#34; like that of recently passed Civil Rights leader Rep John Lewis Best vignette of the roll call, &#34;from the spirit of Good Trouble&#34; 🔥🔥🔥🔥🔥🔥🔥. Yes. Georgia! #DNC2020convention #DNCConvention pic.twitter.com/2O21I5X5Nl— Loooorena &#34;La Tigresa&#34; Mesa @ #BlackLivesMatter 🖤 (@loooorenanicole) August 19, 2020 or the backbone of our country, Black Women, as North Carolina nurse Cozzie Watkins reminds us HELL YES NORTH CAROLINA -- &#34;Black women are *the back bone of this country*&#34; #DNCConvention #DNC2020convention #DemocraticConvention pic.twitter.com/hWzh1jz8X6— Loooorena &#34;La Tigresa&#34; Mesa @ #BlackLivesMatter 🖤 (@loooorenanicole) August 19, 2020 If you missed the roll call, you can view it here. Today begins with some continued speculation on what is happening with the questionable changes to USPS: &#34;What he did was take three big steps forward and took one baby step back, and that just doesn&#39;t do it for us,&#34; House Speaker Nancy Pelosi commented on Postmaster General Louis DeJoy&#39;s annoucement to suspend changes to USPS until after the election. What are those changes? We are still waiting to hear. Will changes already implemented be rolled back (e.g. removal of sorting machines)? Again, that too is unknown. While changes to USPS may be in a suspended state, the USPS is still facing a suspected $25 billion USD dollar shortage. News USPS. - Mailing Voting USPS - Postmaster General Louis DeJoy Statement USPS - Mailin Voting CNN - The post office backed off, but the damage is already done COVID19 - Vaccine CNN - Australia secures deal for potential Covid-19 vaccine, will provide it free to all citizens DNC Convention - Day 2 Recap NPR - Highlights Of The Day 2 Of The Democratic National Convention Events Speakers include President Barack Obama, Senator Elizabeth Warren with performances from Jennifer Hudson and Billie Eilish continuet he Democratic National Contention 2020 tonight at 8:00pm CDT to 10:00pm CDT. Watch live and find the full schedule here. Call to Action Get your flu shot. The WHO, Dr. Fauci, and many other health experts urge us all to get one as we wait for a COVID19 vaccine. Target/CVS already have flu shots, Walgreens is slated to start September 1 2020. Just for fun All our tech for this campaign is powered by amazing technologists whom I am deeply thankful for. Today, I&#39;d like to thank Mica, a #LatinxInTech Chicago DNC engineer who is a prominent lead behind IWillVote.com, &#34;the #1 site for taking action in 2020&#34; as Democrats CTO describes. So, go register on IWillVote.com and send some ❤️ over to Mica: 🗳️ https://t.co/Wy7NIy9YGP is the #1 site for taking action in 2020 -- register, request a ballot and vote! Meet one of the brilliant 🧠 behind it: @_micada! DNC engineer, Chicagoan, electronic 🎶 lover, educator and amplifier 📣 for women and latinx in political tech. 🥳 Mica!!!— nell thomas (@nellwyn) August 18, 2020 Seriously, this Maine B&amp;B - Annabessacook Farm -, owned by DNC Convention Delegate Craig Hickman and his husband, brings me such joy. Who wants to book a 2021 trip? Also, AOC is amazing. Her endorsement of Sen Sanders was in fact in line with DNC Convention procedures: If you were confused, no worries!Convention rules require roll call &amp; nominations for every candidate that passes the delegate threshold.I was asked to 2nd the nom for Sen. Sanders for roll call.I extend my deepest congratulations to @JoeBiden - let’s go win in November. 🇺🇸 https://t.co/uI92P3UfLn— Alexandria Ocasio-Cortez (@AOC) August 19, 2020 So let&#39;s celebrate that and remember AOC&#39;s amazing dance moves, which are only scandalous in that they are scandalously FUNNNNN: via GIPHY", 
            "tags": "day-76", 
            "loc": "/day_76.html"
        },
        {
            "title": "Day 77", 
            "text":"Day 77 Published last at 3:45pm CDT August 18 2020, subject to change throughout the day. Last night Michelle Obama made a very direct ask of us all. Create your voting plan. Details vary state to state and states are scrambling to clarify what date a mail in ballot can be accepted. Update: New York Gov. Andrew Cuomo (D) says he&#39;ll sign the bill to let all voters to vote by mail for November, meaning only 6 states home to 17% of Americans will require a mail voting excuse (all of which exempt voters age 65+). Texas is half of that 17% https://t.co/GyBZCcU9Wz https://t.co/VmqDNGVsKq— Stephen Wolf (@PoliticsWolf) August 18, 2020 So, how are you planning to vote? I asked some of you all to weigh in, and some of you did: Just confirmed my voting registration and mailing address. Also got text alerts setup so I know when my ballot is mailed to me and received. I plan to take my ballot to a local drop site 👍🏻— RedBear (@gizm0_0) August 18, 2020 Registered! Got the receipt and know all my voting location and mail-in ballot drop-offs. Everyone should check their registrations as well as know their voting locations.— mrcartoonster 🇺🇸🇵🇷 (@mrcartoonster) August 18, 2020 So today&#39;s theme is simple -- create your voting plan. News Voting - Mail in Orange County Registrar - Election integrity will be put to the test in California this November Voting - Mail in CBS - With more mail-in ballots, U.S. may not have official results on election night: &#34;Be prepared, be patient&#34; Voting - Mail in The Hill - Postmaster general says he&#39;s pausing changes &#39;until after the election&#39; DNC Convention - Day 1 Recap CNN - Hits and misses from Night 1 of the Democratic National Convention State Election Primaries Five Thirty Eight - What To Watch In Today’s Elections In Alaska, Florida And Wyoming Events Democratic National Contention 2020 continues with primetime content starting at 8:00pm CDT to 10:00pm CDT. Watch live for Representative Alexandria Ocasio-Cortez and Dr. Jill Biden. Full schedule here. Call to Action Make your voting plan. NBC News has a plan your vote voting by mail guide to help you as has the New York Times. Ask 5 folks in your circle &#34;what is your voting plan&#34; and devise ways to hold one another accountable. Keep your Election Protection Hotline number handy: 866-OUR-VOTE, or Michelle Obama will be disappointed in us. Text “TEACH” to “21333” to sign up and learn more about how you can help your students get registered. Just for fun Did you not love Michelle Obama&#39;s VOTE necklace? I think the entire internet did. The original by BYCHARI runs a few hundred, however there are some inspired in the the same spirit of voting like this necklace that donates $5 USD to the League of Women Voters NYC. Enjoy.", 
            "tags": "day-77", 
            "loc": "/day_77.html"
        },
        {
            "title": "Day 78", 
            "text":"Day 78 This week is the 100th year anniversary of the 19th Amendment. Or, better yet, we should remember that this week is only the 100th year anniversary of the 19th Amendment. Even more timely? Last night, being the sci-fi nerd I am, in watching Lovecraft Country last night many pointed to how Lovecraft Country included several images such as the tribute to Gordon Park’s 1956 photograph outside a department store in Mobile, Alabama demonstrating the only to recent segregated past of the United States. I want everyone to notice how @LovecraftHBO recreated powerful imagery from the segregated south. On the LEFT is Gordon Park’s 1956 photograph outside a department store in Mobile, Alabama. On the RIGHT is a brief scene from #LovecraftCountry. 👏👏👏@JordanPeele @jjabrams pic.twitter.com/oH4qUbLP8e— James Paul (@curiousjamesp) August 17, 2020 One of the simplest things each of us can do is to reach out to people within our network, help them develop a voting plan, and keep your folks engaged. News Save USPS - Blockchain Patent U.S. Postal Service Counters Trump Attacks On Mail-In Voting With A New Blockchain Patent) Save USPS - Vote Funding Bill Pelosi to Call House Back Into Session to Vote on USPS Bill Election Prediction Five Thirty Eight - Our Election Forecast Didn’t Say What I Thought It Would COVID19 WBEZ - 50 Lives In 4 ZIP Codes Events Democratic National Contention 2020 August 17 2020 through August 20 2020! Join tonight from 8:00pm CDT to 10:00pm CDT and watch live. Senator Bernie Sanders will speak at 10:00pm CDT as well as Forme First Lady Michelle Obama. Full schedule here. An Election Conversation with NPR’s Asma Khalid &amp; Ron Elving on August 18 2020 @ 12:00pm CDT. Register here. Cyber Security and the 2020 Elections Part II class on August 20 2020 @ 12:30pm CDT hosted by the Campus for Creative Aging. The class will discuss both technical and non-technical issues particularly focused on mail-in ballots. Register here. Decoding the Election hosted by San Francisco’s Computer History Museum on September 16 2020 @ 1:00pm CDT. Panel moderator Steven Levy, Wired editor, will engage panelists to learn about role of social media and AI in USA elections. Register here. Call to Action Join the conversation with the DNC on social at @DNCWarRoom Text VOLUNTEER to 43367 to find volunteer opportunities with the DNC Read more on the DNC online organizing hub Just for fun If you ever wanted to know what the 1996 DNC Convention Macarena dance along with Cardi B - WAP feat. Megan Thee Stallion looked like …. look no further pic.twitter.com/Q42dnG7dUs— kyle van fleet #blm (@kfcvf) August 17, 2020", 
            "tags": "day-78", 
            "loc": "/day_78.html"
        },
        {
            "title": "Day 81", 
            "text":"Welcome to What To Do Today: Day 81 We have only 81 days until the United States 2020 elections. To help keep you informed, this website will be updated daily to include information on election relevant -- meaning topical issues (e.g. prision abolition) as well as election specific -- news, events, and calls to action. If you have something you&#39;d like to add open an issue on GitHub. News Attempt to suppress vote by mail: Washington Post - Trump’s mail ballot claims are part of a long history of voter suppression Learn about Voter Repression: ACLU - Voter Repression 2020 Guide Election 2020 Prediction: Five Thirty Eight - Introduces the 2020 election forecast Poll Wokers Needed: NPR - Wanted: Young People To Work The Polls This November Election 2020 Calendar:. NBC - The 2020 presidential election calendar: Primaries, debates, caucuses and more Events Democratic National Convention runs August 17 - August 20 2020, the DNC is running a series of virtual trainings, which each day dedicated to a theme - Campaign Fundamentals, Organizing, Digital, and Highlights. Examples of trainings: August 17 @ 2:30pm CT &#34;Campaign Data&#34;, August 18 @ 2:45pm CT &#34;Principles of Persuasion Conversations&#34; &amp; @ 4:00pm CT &#34;Get Out the VOTE (by Mail)&#34;, August 19 @ 11:00am CT &#34;Digital Strategy&#34;. Register today. The Future of Political Technology Panel with Higher Ground Labs August 17 @ 2:00pm CT. Register here. Online teach-in with Haymarket Books: The Struggle For Abolition: From The U.S. to Palestine August 20 2020 @ 4:00pm CT. Register here. Online paid content on Being an Antiracist created by speaker and activist Kim Crayton #causeascene. Learn more here. Big Upcoming Election Events - First Presidential Debate @ Cleveland September 29 2020. Jobs Become a Poll Worker Call To Action Help the American Postal Workers Union obtain stimulus funding to keep serving the public. Tell your representative to support VRAA (Voting Rights Advancement Act). Confirm you are registered to vote if you are a US citizen who is elgible to vote. Help protect the United States Postal Service Share this with your friends. Add or suggest content.", 
            "tags": "day-81", 
            "loc": "/day_81.html"
        },
        {
            "title": "About", 
            "text":"The US Presidential Election is Tuesday, November 3 2020. To help keep you informed, this website will be updated daily to include information on election relevant -- meaning topical issues (e.g. prision abolition) as well as election specific -- news, events, and calls to action. Feedback is expected, wanted, and continuously appreciated. Why a digest? Why not? This project is greatly inspired by the awesome work of Matt Kisher&#39;s WTF Just Happened Today. Unlike Matt&#39;s work, this digest is diliberately progressive, left learning, and unapologetic in its position of it. Values of this project Accountability - we all have a hand in this Transparency - how this content is shared will be tied back to original sources Leave things better than how we arrived - yup, basically we all need to step up and do the work, no one gets a cookie because they tweeted a thing that one time Contribute Content What To Do Today US Election 2020 is all open source and managed on GitHub. If you&#39;d like to contribute content including news, events, or call to action open an issue using the issue template. You can also obtain this content via Tiny Letter. Thanks for all you do You are not alone. We matter. We can do this. But, we need to show up daily. Working together. This project is an ever evolving labor of love maintained by Lorena Mesa. A political scientist turned coder, Lorena can be found almost daily on Twitter.", 
            "tags": "pages", 
            "loc": "/pages/about.html"
        }        
    ]
}