{
    "pages": [
        {
            "title": "Day 77", 
            "text":"Day 77 Published last at 09:40am CDT August 18 2020, subject to change throughout the day. Last night Michelle Obama made a very direct ask of us all. Create your voting plan. Details vary state to state and states are scrambling to clarify what date a mail in ballot can be accepted. Update: New York Gov. Andrew Cuomo (D) says he&#39;ll sign the bill to let all voters to vote by mail for November, meaning only 6 states home to 17% of Americans will require a mail voting excuse (all of which exempt voters age 65+). Texas is half of that 17% https://t.co/GyBZCcU9Wz https://t.co/VmqDNGVsKq— Stephen Wolf (@PoliticsWolf) August 18, 2020 So, how are you planning to vote? I asked some of you all to weigh in, and some of you did: Just confirmed my voting registration and mailing address. Also got text alerts setup so I know when my ballot is mailed to me and received. I plan to take my ballot to a local drop site 👍🏻— RedBear (@gizm0_0) August 18, 2020 Registered! Got the receipt and know all my voting location and mail-in ballot drop-offs. Everyone should check their registrations as well as know their voting locations.— mrcartoonster 🇺🇸🇵🇷 (@mrcartoonster) August 18, 2020 So today&#39;s theme is simple -- create your voting plan. News Voting - Mail in Orange County Registrar - Election integrity will be put to the test in California this November Voting - Mail in CBS - With more mail-in ballots, U.S. may not have official results on election night: &#34;Be prepared, be patient&#34; Voting - Mail in DNC Convention - Day 1 Recap CNN - Hits and misses from Night 1 of the Democratic National Convention Events Democratic National Contention 2020 continues with primetime content starting at 8:00pm CDT to 10:00pm CDT. Watch live for Representative Alexandria Ocasio-Cortez and Dr. Jill Biden. Full schedule here. Call to Action Make your voting plan. NBC News has a plan your vote voting by mail guide to help you. Ask 5 folks in your circle &#34;what is your voting plan&#34; and devise ways to hold one another accountable. Keep your Election Protection Hotline number handy: 866-OUR-VOTE, or Michelle Obama will be disappointed in us. Text “TEACH” to “21333” to sign up and learn more about how you can help your students get registered. Just for fun Did you not love Michelle Obama&#39;s VOTE necklace? I think the entire internet did. The original by BYCHARI runs a few hundred, however there are some inspired in the the same spirit of voting like this necklace that donates $5 USD to the League of Women Voters NYC. Enjoy.", 
            "tags": "day-77", 
            "loc": "/day_77.html"
        },
        {
            "title": "Day 78", 
            "text":"Day 78 This week is the 100th year anniversary of the 19th Amendment. Or, better yet, we should remember that this week is only the 100th year anniversary of the 19th Amendment. Even more timely? Last night, being the sci-fi nerd I am, in watching Lovecraft Country last night many pointed to how Lovecraft Country included several images such as the tribute to Gordon Park’s 1956 photograph outside a department store in Mobile, Alabama demonstrating the only to recent segregated past of the United States. I want everyone to notice how @LovecraftHBO recreated powerful imagery from the segregated south. On the LEFT is Gordon Park’s 1956 photograph outside a department store in Mobile, Alabama. On the RIGHT is a brief scene from #LovecraftCountry. 👏👏👏@JordanPeele @jjabrams pic.twitter.com/oH4qUbLP8e— James Paul (@curiousjamesp) August 17, 2020 One of the simplest things each of us can do is to reach out to people within our network, help them develop a voting plan, and keep your folks engaged. News Save USPS - Blockchain Patent U.S. Postal Service Counters Trump Attacks On Mail-In Voting With A New Blockchain Patent) Save USPS - Vote Funding Bill Pelosi to Call House Back Into Session to Vote on USPS Bill Election Prediction Five Thirty Eight - Our Election Forecast Didn’t Say What I Thought It Would COVID19 WBEZ - 50 Lives In 4 ZIP Codes Events Democratic National Contention 2020 August 17 2020 through August 20 2020! Join tonight from 8:00pm CDT to 10:00pm CDT and watch live. Senator Bernie Sanders will speak at 10:00pm CDT as well as Forme First Lady Michelle Obama. Full schedule here. An Election Conversation with NPR’s Asma Khalid &amp; Ron Elving on August 18 2020 @ 12:00pm CDT. Register here. Cyber Security and the 2020 Elections Part II class on August 20 2020 @ 12:30pm CDT hosted by the Campus for Creative Aging. The class will discuss both technical and non-technical issues particularly focused on mail-in ballots. Register here. Decoding the Election hosted by San Francisco’s Computer History Museum on September 16 2020 @ 1:00pm CDT. Panel moderator Steven Levy, Wired editor, will engage panelists to learn about role of social media and AI in USA elections. Register here. Call to Action Join the conversation with the DNC on social at @DNCWarRoom Text VOLUNTEER to 43367 to find volunteer opportunities with the DNC Read more on the DNC online organizing hub Just for fun If you ever wanted to know what the 1996 DNC Convention Macarena dance along with Cardi B - WAP feat. Megan Thee Stallion looked like …. look no further pic.twitter.com/Q42dnG7dUs— kyle van fleet #blm (@kfcvf) August 17, 2020", 
            "tags": "day-78", 
            "loc": "/day_78.html"
        },
        {
            "title": "Day 81", 
            "text":"Welcome to What To Do Today: Day 81 We have only 81 days until the United States 2020 elections. To help keep you informed, this website will be updated daily to include information on election relevant -- meaning topical issues (e.g. prision abolition) as well as election specific -- news, events, and calls to action. If you have something you&#39;d like to add open an issue on GitHub. News Attempt to suppress vote by mail: Washington Post - Trump’s mail ballot claims are part of a long history of voter suppression Learn about Voter Repression: ACLU - Voter Repression 2020 Guide Election 2020 Prediction: Five Thirty Eight - Introduces the 2020 election forecast Poll Wokers Needed: NPR - Wanted: Young People To Work The Polls This November Election 2020 Calendar:. NBC - The 2020 presidential election calendar: Primaries, debates, caucuses and more Events Democratic National Convention runs August 17 - August 20 2020, the DNC is running a series of virtual trainings, which each day dedicated to a theme - Campaign Fundamentals, Organizing, Digital, and Highlights. Examples of trainings: August 17 @ 2:30pm CT &#34;Campaign Data&#34;, August 18 @ 2:45pm CT &#34;Principles of Persuasion Conversations&#34; &amp; @ 4:00pm CT &#34;Get Out the VOTE (by Mail)&#34;, August 19 @ 11:00am CT &#34;Digital Strategy&#34;. Register today. The Future of Political Technology Panel with Higher Ground Labs August 17 @ 2:00pm CT. Register here. Online teach-in with Haymarket Books: The Struggle For Abolition: From The U.S. to Palestine August 20 2020 @ 4:00pm CT. Register here. Online paid content on Being an Antiracist created by speaker and activist Kim Crayton #causeascene. Learn more here. Big Upcoming Election Events - First Presidential Debate @ Cleveland September 29 2020. Jobs Become a Poll Worker Call To Action Help the American Postal Workers Union obtain stimulus funding to keep serving the public. Tell your representative to support VRAA (Voting Rights Advancement Act). Confirm you are registered to vote if you are a US citizen who is elgible to vote. Help protect the United States Postal Service Share this with your friends. Add or suggest content.", 
            "tags": "day-81", 
            "loc": "/day_81.html"
        },
        {
            "title": "About", 
            "text":"The US Presidential Election is Tuesday, November 3 2020. To help keep you informed, this website will be updated daily to include information on election relevant -- meaning topical issues (e.g. prision abolition) as well as election specific -- news, events, and calls to action. Feedback is expected, wanted, and continuously appreciated. Why a digest? Why not? This project is greatly inspired by the awesome work of Matt Kisher&#39;s WTF Just Happened Today. Unlike Matt&#39;s work, this digest is diliberately progressive, left learning, and unapologetic in its position of it. Values of this project Accountability - we all have a hand in this Transparency - how this content is shared will be tied back to original sources Leave things better than how we arrived - yup, basically we all need to step up and do the work, no one gets a cookie because they tweeted a thing that one time Contribute Content What To Do Today US Election 2020 is all open source and managed on GitHub. If you&#39;d like to contribute content including news, events, or call to action open an issue using the issue template. You can also obtain this content via Tiny Letter. Thanks for all you do You are not alone. We matter. We can do this. But, we need to show up daily. Working together. This project is an ever evolving labor of love maintained by Lorena Mesa. A political scientist turned coder, Lorena can be found almost daily on Twitter.", 
            "tags": "pages", 
            "loc": "/pages/about.html"
        }        
    ]
}