{
    "pages": [
        {
            "title": "Day 81", 
            "text":"Welcome to What To Do Today: Day 81 We have only 81 days until the United States 2020 elections. To help keep you informed, this website will be updated daily to include information on election relevant -- meaning topical issues (e.g. prision abolition) as well as election specific -- news, events, and calls to action. If you have something you&#39;d like to add open an issue on GitHub. News Attempt to suppress vote by mail: Washington Post - Trump’s mail ballot claims are part of a long history of voter suppression Learn about Voter Repression: ACLU - Voter Repression 2020 Guide Election 2020 Prediction: Five Thirty Eight - Introduces the 2020 election forecast Poll Wokers Needed: NPR - Wanted: Young People To Work The Polls This November Election 2020 Calendar:. NBC - The 2020 presidential election calendar: Primaries, debates, caucuses and more Events Democratic National Convention runs August 17 - August 20 2020, the DNC is running a series of virtual trainings, which each day dedicated to a theme - Campaign Fundamentals, Organizing, Digital, and Highlights. Examples of trainings: August 17 @ 2:30pm CT &#34;Campaign Data&#34;, August 18 @ 2:45pm CT &#34;Principles of Persuasion Conversations&#34; &amp; @ 4:00pm CT &#34;Get Out the VOTE (by Mail)&#34;, August 19 @ 11:00am CT &#34;Digital Strategy&#34;. Register today. The Future of Political Technology Panel with Higher Ground Labs August 17 @ 2:00pm CT. Register here. Online teach-in with Haymarket Books: The Struggle For Abolition: From The U.S. to Palestine August 20 2020 @ 4:00pm CT. Register here. Online paid content on Being an Antiracist created by speaker and activist Kim Crayton #causeascene. Learn more here. Big Upcoming Election Events - First Presidential Debate @ Cleveland September 29 2020. Jobs Become a Poll Worker Call To Action Help the American Postal Workers Union obtain stimulus funding to keep serving the public. Tell your representative to support VRAA (Voting Rights Advancement Act). Confirm you are registered to vote if you are a US citizen who is elgible to vote. Help protect the United States Postal Service Share this with your friends. Add or suggest content.", 
            "tags": "day-81", 
            "loc": "/day_81.html"
        },
        {
            "title": "About", 
            "text":"The US Presidential Election is Tuesday, November 3 2020. To help keep you informed, this website will be updated daily to include information on election relevant -- meaning topical issues (e.g. prision abolition) as well as election specific -- news, events, and calls to action. Feedback is expected, wanted, and continuously appreciated. Why a digest? Why not? This project is greatly inspired by the awesome work of Matt Kisher&#39;s WTF Just Happened Today. Unlike Matt&#39;s work, this digest is diliberately progressive, left learning, and unapologetic in its position of it. Values of this project Accountability - we all have a hand in this Transparency - how this content is shared will be tied back to original sources Leave things better than how we arrived - yup, basically we all need to step up and do the work, no one gets a cookie because they tweeted a thing that one time Contribute Content What To Do Today US Election 2020 is all open source and managed on GitHub. If you&#39;d like to contribute content including news, events, or call to action open an issue using the issue template. You can also obtain this content via Tiny Letter. Thanks for all you do You are not alone. We matter. We can do this. But, we need to show up daily. Working together. This project is an ever evolving labor of love maintained by Lorena Mesa. A political scientist turned coder, Lorena can be found almost daily on Twitter.", 
            "tags": "pages", 
            "loc": "/pages/about.html"
        }        
    ]
}